; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	thermograph0 - mode
	Star6 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet13)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 image1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite2 GroundStation4)
	(pointing satellite4 Star10)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 image1)
	(have_image Planet13 image1)
	(have_image Planet14 thermograph0)
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph0)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite4 groundstation1 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 14
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 14
3. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 14
4. (turn_to satellite4 planet12 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet12)
   goals met: 0 of 14
5. (take_image satellite4 planet12 instrument10 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 14
6. (turn_to satellite4 phenomenon8 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon8)
   goals met: 1 of 14
7. (take_image satellite4 phenomenon8 instrument10 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 2 of 14
8. (turn_to satellite4 phenomenon16 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon16)
   goals met: 2 of 14
9. (take_image satellite4 phenomenon16 instrument10 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 3 of 14
10. (turn_to satellite4 phenomenon11 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon11)
   goals met: 3 of 14
11. (turn_to satellite2 groundstation4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation4)
   goals met: 4 of 14
12. (turn_to satellite0 phenomenon8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 14
13. (take_image satellite4 phenomenon11 instrument10 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 6 of 14
14. (turn_to satellite4 planet13 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet13)
   goals met: 6 of 14
15. (take_image satellite4 planet13 instrument10 image1)
   added: (have_image planet13 image1)
   goals met: 7 of 14
16. (turn_to satellite4 planet14 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet14)
   goals met: 7 of 14
17. (take_image satellite4 planet14 instrument10 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 8 of 14
18. (turn_to satellite4 planet15 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet15)
   goals met: 8 of 14
19. (take_image satellite4 planet15 instrument10 image1)
   added: (have_image planet15 image1)
   goals met: 9 of 14
20. (turn_to satellite4 planet17 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet17)
   goals met: 9 of 14
21. (take_image satellite4 planet17 instrument10 image1)
   added: (have_image planet17 image1)
   goals met: 10 of 14
22. (turn_to satellite4 planet9 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet9)
   goals met: 10 of 14
23. (take_image satellite4 planet9 instrument10 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 11 of 14
24. (turn_to satellite4 star7 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star7)
   goals met: 11 of 14
25. (take_image satellite4 star7 instrument10 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 12 of 14
26. (turn_to satellite4 star10 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star10)
   goals met: 13 of 14
27. (take_image satellite4 star10 instrument10 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 14 of 14
